# StairsAttrLandingsOverlapping Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrLandingsOverlapping Property
ParameterTypeId Class See Also
---
"Landing Overlap"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrLandingsOverlapping { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrLandingsOverlapping As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrLandingsOverlapping {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace